cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap "caskroom/versions"

brew "mas"

cask 'google-chrome'
cask 'iterm2'
cask 'intellij-idea'
cask 'visual-studio-code'
cask 'google-japanese-ime'
cask 'macs-fan-control'
cask 'xquartz'
cask 'the-unarchiver'
cask 'cyberduck'
cask 'java'
cask 'hyper'
cask 'macdown'

mas "Slack", id: 803453959
mas "Xcode", id: 497799835

brew "git"
brew "hub"

# lang
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "rbenv"
brew "ruby-build"
brew "nvm"
brew "goenv"

# tools
brew "peco"
brew "jq"
brew "nkf"
